hammer-dp-ua/WiFiMotionDetector_with_Immobilizer-STM32/app/main.c
void DMA1_Channel2_3_IRQHandler() {
   DMA_ClearITPendingBit(DMA1_IT_TC2);
}

void TIM14_IRQHandler() {
   TIM_ClearITPendingBit(TIM14, TIM_IT_Update);

   response_timeout_timer_g++;
   if (visible_network_list_timer_g) {
      visible_network_list_timer_g--;
   }
   if (checking_connection_status_and_server_availability_timer_g) {
      checking_connection_status_and_server_availability_timer_g--;
   }
   if (!is_esp8266_enabled(0)) {
      esp8266_disabled_counter_g++;
   }
   if (esp8266_disabled_timer_g > 0) {
      esp8266_disabled_timer_g--;
   }
   if (beeper_inactive_timer_g) {
      beeper_inactive_timer_g--;
   }
   if (beeper_interval_timer_g) {
      beeper_interval_timer_g--;
   }
   if (beeper_alarm_prior_to_response_period_timer_g) {
      beeper_alarm_prior_to_response_period_timer_g--;
   }
   if (inactive_alarm_trigger_timer_g) {
      inactive_alarm_trigger_timer_g--;
   }
   if (false_pir_alarm_timer_g) {
      false_pir_alarm_timer_g--;
   }
   if (false_mw_alarm_timer_g) {
      false_mw_alarm_timer_g--;
   }
   if (immobilizer_activation_led_signalization_timer_g) {
      immobilizer_activation_led_signalization_timer_g--;
   }
   if (immobilizer_anti_jitter_timer_g) {
      immobilizer_anti_jitter_timer_g--;
   }
}

void TIM3_IRQHandler() {
   TIM_ClearITPendingBit(TIM3, TIM_IT_Update);

   // Some error eventually occurs when only the first symbol is exists
   if (usart_received_bytes_g > 1) {
      set_flag(&general_flags_g, USART_DATA_RECEIVED_FLAG);
   }
   usart_received_bytes_g = 0;
   if (send_usart_data_function_g != NULL) {
      send_usart_data_time_counter_g++;
   }
   if (immobilizer_activation_led_signalization_period_timer_g) {
      immobilizer_activation_led_signalization_period_timer_g--;
   }
   network_searching_status_led_counter_g++;
}

void EXTI0_1_IRQHandler() {
   if (EXTI_GetITStatus(MOTION_SENSOR_EXTI_LINE)) {
      EXTI_ClearITPendingBit(MOTION_SENSOR_EXTI_LINE);

      if (!inactive_alarm_trigger_timer_g) {
         if (GPIO_ReadInputDataBit(MOTION_SENSOR_INPUT_PORT, MOTION_SENSOR_INPUT_PIN)) {
            //GPIO_WriteBit(MOTION_SENSOR_LED_PORT, MOTION_SENSOR_LED_PIN, Bit_SET);

            set_flag(&general_flags_g, ALARM_FLAG);
         } else {
            //GPIO_WriteBit(MOTION_SENSOR_LED_PORT, MOTION_SENSOR_LED_PIN, Bit_RESET);
         }
      }
      inactive_alarm_trigger_timer_g = TIMER14_3S;
   }
}

void EXTI4_15_IRQHandler() {
   if (EXTI_GetITStatus(IMMOBILIZER_LED_OUT_EXTI_LINE)) {
      EXTI_ClearITPendingBit(IMMOBILIZER_LED_OUT_EXTI_LINE);
      start_immobilizer_anti_jitter_timer();
   } else if (EXTI_GetITStatus(PIR_LED_OUT_EXTI_LINE)) {
      EXTI_ClearITPendingBit(PIR_LED_OUT_EXTI_LINE);
      if (!GPIO_ReadInputDataBit(PIR_LED_OUT_PORT, PIR_LED_OUT_PIN)) {
         set_flag(&general_flags_g, PIR_ACTIVATED_FLAG);
         false_pir_alarm_timer_g = TIMER14_5S;
      }
   } else if (EXTI_GetITStatus(MW_LED_OUT_EXTI_LINE)) {
      EXTI_ClearITPendingBit(MW_LED_OUT_EXTI_LINE);
      if (!GPIO_ReadInputDataBit(MW_LED_OUT_PORT, MW_LED_OUT_PIN)) {
         set_flag(&general_flags_g, MW_ACTIVATED_FLAG);
         false_mw_alarm_timer_g = TIMER14_5S;
      }
   }
}

void USART1_IRQHandler() {
   if (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == SET) {
      TIM_SetCounter(TIM3, 0);
      usart_data_received_buffer_g[usart_received_bytes_g] = USART_ReceiveData(USART1);
      usart_received_bytes_g++;

      if (usart_received_bytes_g >= USART_DATA_RECEIVED_BUFFER_SIZE) {
         usart_received_bytes_g = 0;
      }
   }

   if (USART_GetFlagStatus(USART1, USART_FLAG_ORE)) {
      USART_ClearITPendingBit(USART1, USART_IT_ORE);
      USART_ClearFlag(USART1, USART_FLAG_ORE);
      usart_overrun_errors_counter_g++;
   } else if (USART_GetFlagStatus(USART1, USART_FLAG_IDLE)) {
      USART_ClearITPendingBit(USART1, USART_IT_ORE);
      USART_ClearFlag(USART1, USART_FLAG_IDLE);
      usart_idle_line_detection_counter_g++;
   } else if (USART_GetFlagStatus(USART1, USART_FLAG_NE)) {
      USART_ClearITPendingBit(USART1, USART_IT_ORE);
      USART_ClearFlag(USART1, USART_FLAG_NE);
      usart_noise_detection_counter_g++;
   } else if (USART_GetFlagStatus(USART1, USART_FLAG_FE)) {
      USART_ClearITPendingBit(USART1, USART_IT_ORE);
      USART_ClearFlag(USART1, USART_FLAG_FE);
      usart_framing_errors_counter_g++;
   }
}

int main() {
   RCC_APB2PeriphClockCmd(RCC_APB2Periph_DBGMCU, ENABLE);
   IWDG_Config();
   Clock_Config();
   Pins_Config();
   disable_esp8266();
   enable_immobilizer();
   DMA_Config();
   USART_Config();
   TIMER3_Confing();
   TIMER14_Confing();
   EXTERNAL_Interrupt_Config();

   add_piped_task_to_send_into_tail(DISABLE_ECHO_FLAG);
   add_piped_task_to_send_into_tail(GET_CURRENT_DEFAULT_WIFI_MODE_FLAG);
   add_piped_task_to_send_into_tail(GET_OWN_IP_ADDRESS_FLAG);
   add_piped_task_to_send_into_tail(GET_CONNECTION_STATUS_AND_CONNECT_FLAG);
   add_piped_task_to_send_into_tail(GET_SERVER_AVAILABILITY_FLAG);

   unsigned char beeper_counter = 0;

   while (1) {
      if (is_esp8266_enabled(1)) {
         // Seconds
         unsigned char send_usart_data_passed_time_sec = (unsigned char) (TIMER3_PERIOD_SEC * send_usart_data_time_counter_g);
         unsigned int sent_flag = 0;

         if (read_flag(&general_flags_g, USART_DATA_RECEIVED_FLAG)) {
            reset_flag(&general_flags_g, USART_DATA_RECEIVED_FLAG);

            if (usart_data_to_be_transmitted_buffer_g != NULL) {
               free(usart_data_to_be_transmitted_buffer_g);
               usart_data_to_be_transmitted_buffer_g = NULL;
            }

            if (is_string_starts_with(usart_data_received_buffer_g, RESPONSE_CLOSED_BY_TOMCAT_PREFIX)
                  || is_string_starts_with(usart_data_received_buffer_g, RESPONSE_CLOSED_BY_TOMCAT_SUFFIX)) {
               is_string_starts_with(usart_data_received_buffer_g, RESPONSE_CLOSED_BY_TOMCAT_PREFIX);
            } else {
               sent_flag = sent_flag_g;
            }
         } else if (send_usart_data_function_g != NULL && send_usart_data_passed_time_sec >= send_usart_data_timout_sec_g) {
            if (usart_data_to_be_transmitted_buffer_g != NULL) {
               free(usart_data_to_be_transmitted_buffer_g);
               usart_data_to_be_transmitted_buffer_g = NULL;
            }

            send_usart_data_function_g();
         }

         unsigned int current_piped_task_to_send = get_current_piped_task_to_send();
         if (send_usart_data_function_g != NULL) {
            current_piped_task_to_send = 0;
         }

         if (current_piped_task_to_send || sent_flag) {
            unsigned char not_handled = 1;
            not_handled = handle_disable_echo_flag(current_piped_task_to_send, &sent_flag);

