hammer-dp-ua/WiFiMotionDetector_with_Immobilizer-STM32/app/main.c
            if (not_handled) {
               not_handled = handle_get_connection_status_and_connect_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_get_connection_status_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_connect_to_network_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_connect_to_server_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_set_bytes_to_send_in_request_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_get_request_sent_and_response_received_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_get_current_default_wifi_mode_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_set_default_station_wifi_mode_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_get_own_ip_address_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_set_own_ip_address_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_close_connection_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_get_server_availability_flag(current_piped_task_to_send);
            }
            if (not_handled) {
               not_handled = handle_get_server_availability_request_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_send_alarm_flag(current_piped_task_to_send);
            }
            if (not_handled) {
               not_handled = handle_send_alarm_request_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_send_immobilizer_activated_flag(current_piped_task_to_send);
            }
            if (not_handled) {
               not_handled = handle_send_immobilizer_activated_request_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_send_immobilizer_deactivated_flag(current_piped_task_to_send);
            }
            if (not_handled) {
               not_handled = handle_send_immobilizer_deactivated_request_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_get_visible_network_list_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_send_false_alarm_flags(current_piped_task_to_send);
            }
            if (not_handled) {
               not_handled = handle_send_false_pir_alarm_request_flag(current_piped_task_to_send, &sent_flag);
            }
            if (not_handled) {
               not_handled = handle_send_false_mw_alarm_request_flag(current_piped_task_to_send, &sent_flag);
            }
         }

         check_connection_status_and_server_availability();
         check_visible_network_list();

         // LED blinking
         if (!read_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG) && network_searching_status_led_counter_g >= TIMER3_100MS) {
            network_searching_status_led_counter_g = 0;

            if (GPIO_ReadOutputDataBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN)) {
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_RESET);
            } else {
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
            }
         }

         if (!immobilizer_activation_led_signalization_timer_g) {
            if (read_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG)) {
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
            } else {
               reset_flag(&general_flags_g, SERVER_IS_AVAILABLE_FLAG);
            }
            if (read_flag(&general_flags_g, SERVER_IS_AVAILABLE_FLAG)) {
               GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_SET);
            } else {
               GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);
            }
         } else if (immobilizer_activation_led_signalization_timer_g && !immobilizer_activation_led_signalization_period_timer_g) {
            immobilizer_activation_led_signalization_period_timer_g = TIMER3_100MS;
            if (GPIO_ReadOutputDataBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN)) {
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_RESET);
               GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_SET);
            } else {
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
               GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);
            }
         }

         if (send_usart_data_errors_counter_g >= 5 || is_piped_tasks_scheduler_full()) {
            reset_device_state();
         }
         if (resets_occured_g >= 10) {
            NVIC_SystemReset();
         }

         unsigned char activate_beeper = 0;
         if (is_immobilizer_status_ready_to_be_read()) {
            if (!GPIO_ReadInputDataBit(IMMOBILIZER_LED_OUT_PORT, IMMOBILIZER_LED_OUT_PIN) && !read_flag(&general_flags_g, LAST_SENT_IMMOBILIZER_ACTION_WAS_ACTIVATION_FLAG)) {
               add_piped_task_to_send_into_tail(SEND_IMMOBILIZER_ACTIVATED_FLAG);
               activate_beeper = 1;
               immobilizer_activation_led_signalization_timer_g = TIMER14_60S;
               set_flag(&general_flags_g, LAST_SENT_IMMOBILIZER_ACTION_WAS_ACTIVATION_FLAG);
            } else if (GPIO_ReadInputDataBit(IMMOBILIZER_LED_OUT_PORT, IMMOBILIZER_LED_OUT_PIN) && read_flag(&general_flags_g, LAST_SENT_IMMOBILIZER_ACTION_WAS_ACTIVATION_FLAG)) {
               add_piped_task_to_send_into_tail(SEND_IMMOBILIZER_DEACTIVATED_FLAG);
               reset_flag(&general_flags_g, LAST_SENT_IMMOBILIZER_ACTION_WAS_ACTIVATION_FLAG);
            }
            reset_immobilizer_status();
         }

