hammer-dp-ua/WiFiMotionDetector_with_Immobilizer-STM32/app/main.c
         if (read_flag(&general_flags_g, ALARM_FLAG) && is_piped_tasks_scheduler_empty()) {
            add_piped_task_to_send_into_tail(SEND_ALARM_FLAG);
            reset_flag(&general_flags_g, ALARM_FLAG);
            reset_flag(&general_flags_g, PIR_ACTIVATED_FLAG);
            reset_flag(&general_flags_g, MW_ACTIVATED_FLAG);
         }
         if (read_flag(&general_flags_g, PIR_ACTIVATED_FLAG) && !false_pir_alarm_timer_g && is_piped_tasks_scheduler_empty()) {
            reset_flag(&general_flags_g, PIR_ACTIVATED_FLAG);
            add_piped_task_to_send_into_tail(SEND_FALSE_PIR_ALARM_FLAG);
         }
         if (read_flag(&general_flags_g, MW_ACTIVATED_FLAG) && !false_mw_alarm_timer_g && is_piped_tasks_scheduler_empty()) {
            reset_flag(&general_flags_g, MW_ACTIVATED_FLAG);
            add_piped_task_to_send_into_tail(SEND_FALSE_MW_ALARM_FLAG);
         }

         beep_twice(&beeper_counter, activate_beeper, read_flag(&general_flags_g, IMMOBILIZER_ACTIVATED_SERVER_RECEIVED_FLAG), reset_immobilizer_activated_server_received_flag);
      } else if (esp8266_disabled_counter_g >= TIMER14_1S) {
         esp8266_disabled_counter_g = 0;
         enable_esp8266();
      }

      IWDG_ReloadCounter();
   }
}

unsigned char handle_disable_echo_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == DISABLE_ECHO_FLAG) {
      not_handled = 0;
      schedule_function_resending(disable_echo, 2, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, DISABLE_ECHO_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, DISABLE_ECHO_FLAG);

      if (is_usart_response_contains_element(USART_OK)) {
         on_successfully_receive_general_actions();
      } else {
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_get_connection_status_and_connect_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == GET_CONNECTION_STATUS_AND_CONNECT_FLAG) {
      not_handled = 0;
      schedule_function_resending(get_connection_status, 2, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, GET_CONNECTION_STATUS_AND_CONNECT_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, GET_CONNECTION_STATUS_AND_CONNECT_FLAG);

      if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME) || is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
         on_successfully_receive_general_actions();

         if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME)) {
            // Has already been connected
            set_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
         } else if (is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
            reset_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
            // Connect
            add_piped_task_to_send_into_head(CONNECT_TO_NETWORK_FLAG);
         }
      } else {
         reset_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_get_connection_status_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == GET_CONNECTION_STATUS_FLAG) {
      not_handled = 0;
      schedule_function_resending(get_connection_status, 2, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, GET_CONNECTION_STATUS_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, GET_CONNECTION_STATUS_FLAG);

      if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME) || is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
         on_successfully_receive_general_actions();

         if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME)) {
            // Has already been connected
            set_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
         } else if (is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
            reset_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
         }
      } else {
         reset_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_connect_to_network_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == CONNECT_TO_NETWORK_FLAG) {
      not_handled = 0;
      schedule_function_resending(connect_to_network, 10, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, CONNECT_TO_NETWORK_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, CONNECT_TO_NETWORK_FLAG);

      if (is_usart_response_contains_element(USART_OK)) {
         on_successfully_receive_general_actions();

         set_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
         GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
      } else {
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_connect_to_server_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == CONNECT_TO_SERVER_FLAG) {
      not_handled = 0;
      schedule_function_resending(connect_to_server, 10, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, CONNECT_TO_SERVER_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, CONNECT_TO_SERVER_FLAG);

      char *data_to_be_contained[] = {ESP8226_RESPONSE_CONNECTED, USART_OK};
      if (is_usart_response_contains_elements(data_to_be_contained, 2) || is_usart_response_contains_element(ESP8226_RESPONSE_ALREADY_CONNECTED)) {
         on_successfully_receive_general_actions();
      } else {
         add_error();
      }
   }
   return not_handled;
}

