hammer-dp-ua/WiFiMotionDetector_with_Immobilizer-STM32/app/main.c
         if (is_usart_response_contains_element(ESP8226_RESPONSE_OK_STATUS_CODE)) {
            on_successfully_receive_general_actions();
            set_flag(&general_flags_g, IMMOBILIZER_ACTIVATED_SERVER_RECEIVED_FLAG);
         } else {
            add_error();
         }
      }
   }
   return not_handled;
}

unsigned char handle_send_immobilizer_deactivated_flag(unsigned int current_piped_task_to_send) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == SEND_IMMOBILIZER_DEACTIVATED_FLAG) {
      not_handled = 0;
      // Request 1 part. Preparation
      delete_piped_task(current_piped_task_to_send);
      send_immobilizer_deactivation(SEND_IMMOBILIZER_DEACTIVATED_REQUEST_FLAG);
   }
   return not_handled;
}

unsigned char handle_send_immobilizer_deactivated_request_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == SEND_IMMOBILIZER_DEACTIVATED_REQUEST_FLAG) {
      not_handled = 0;
      // Part 2
      schedule_global_function_resending_and_send_request(SEND_IMMOBILIZER_DEACTIVATED_REQUEST_FLAG);
   } else if (read_flag(sent_flag, SEND_IMMOBILIZER_DEACTIVATED_REQUEST_FLAG)) {
      not_handled = 0;

      if (is_usart_response_contains_element(ESP8226_RESPONSE_SUCCSESSFULLY_SENT) && !is_usart_response_contains_element(ESP8226_RESPONSE_OK_STATUS_CODE)) {
         // Sometimes only "SEND OK" is received. Another data will be received later
         clear_usart_data_received_buffer();
      } else {
         reset_flag(&sent_flag_g, SEND_IMMOBILIZER_DEACTIVATED_REQUEST_FLAG);

         if (is_usart_response_contains_element(ESP8226_RESPONSE_OK_STATUS_CODE)) {
            on_successfully_receive_general_actions();
         } else {
            add_error();
         }
      }
   }
   return not_handled;
}

unsigned char handle_get_visible_network_list_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == GET_VISIBLE_NETWORK_LIST_FLAG) {
      not_handled = 0;
      schedule_function_resending(get_network_list, 20, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, GET_VISIBLE_NETWORK_LIST_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, GET_VISIBLE_NETWORK_LIST_FLAG);

      if (is_usart_response_contains_element(ESP8226_RESPONSE_VISIBLE_NETWORK_LIST_PREFIX)) {
         on_successfully_receive_general_actions();
         save_default_access_point_gain();
      } else {
         add_error();
      }
   }
   return not_handled;
}

void reset_device_state() {
   unsigned char is_alarm_occured = is_piped_task_to_send_scheduled(SEND_ALARM_FLAG);

   resets_occured_g++;
   delete_all_piped_tasks();
   clear_piped_request_commands_to_send();
   clear_usart_data_received_buffer();
   on_response_g = NULL;
   send_usart_data_function_g = NULL;

   if (received_usart_error_data_g != NULL) {
      free(received_usart_error_data_g);
      received_usart_error_data_g = NULL;
   }

   general_flags_g = 0;
   sent_flag_g = 0;
   send_usart_data_errors_counter_g = 0;

   GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);

   add_piped_task_to_send_into_tail(GET_CONNECTION_STATUS_AND_CONNECT_FLAG);
   add_piped_task_to_send_into_tail(GET_SERVER_AVAILABILITY_FLAG);
   if (is_alarm_occured) {
      add_piped_task_to_send_into_tail(SEND_ALARM_FLAG);
   }
}

void beep_twice(unsigned char *beeper_counter, unsigned char activate_beeper, unsigned char server_received_ack, void (*on_server_received)()) {
   if (activate_beeper && !beeper_inactive_timer_g) {
      beeper_inactive_timer_g = TIMER14_30S;
      *beeper_counter = 1;
      set_flag(&general_flags_g, BEEPER_ACTIVATED_AFTER_PAUSE_FLAG);
      set_flag(&general_flags_g, BEEPER_ACTIVATED_SERVER_RECEIVED_AFTER_PAUSE_FLAG);
   }

   if (read_flag(&general_flags_g, BEEPER_ACTIVATED_AFTER_PAUSE_FLAG) && *beeper_counter && !beeper_interval_timer_g) {
      beeper_interval_timer_g = TIMER14_200MS;

      switch (*beeper_counter) {
         case 1:
            turn_beeper_on();
            *beeper_counter = *beeper_counter + 1;
            break;
         case 2:
            turn_beeper_off();
            *beeper_counter = *beeper_counter + 1;
            break;
         case 3:
            turn_beeper_on();
            *beeper_counter = *beeper_counter + 1;
            break;
         default:
            turn_beeper_off();
            *beeper_counter = 0;
            beeper_interval_timer_g = 0;
            beeper_alarm_prior_to_response_period_timer_g = TIMER14_500MS;
            reset_flag(&general_flags_g, BEEPER_ACTIVATED_AFTER_PAUSE_FLAG);
            break;
      }
   }

   if (server_received_ack && read_flag(&general_flags_g, BEEPER_ACTIVATED_SERVER_RECEIVED_AFTER_PAUSE_FLAG) && !read_flag(&general_flags_g, BEEPER_ACTIVATED_AFTER_PAUSE_FLAG)) {
      on_server_received();
      *beeper_counter = 1;
      set_flag(&general_flags_g, BEEPER_SERVER_RECEIVED_ACK_FLAG);
   }

   if (read_flag(&general_flags_g, BEEPER_SERVER_RECEIVED_ACK_FLAG) && !beeper_alarm_prior_to_response_period_timer_g && *beeper_counter && !beeper_interval_timer_g) {
      beeper_interval_timer_g = TIMER14_200MS;

      switch (*beeper_counter) {
         case 1:
            turn_beeper_on();
            *beeper_counter = *beeper_counter + 1;
            break;
         case 2:
            turn_beeper_off();
            *beeper_counter = *beeper_counter + 1;
            break;
         case 3:
            turn_beeper_on();
            *beeper_counter = *beeper_counter + 1;
            break;
         default:
            turn_beeper_off();
            *beeper_counter = 0;
            beeper_interval_timer_g = 0;
            reset_flag(&general_flags_g, BEEPER_SERVER_RECEIVED_ACK_FLAG);
            reset_flag(&general_flags_g, BEEPER_ACTIVATED_SERVER_RECEIVED_AFTER_PAUSE_FLAG);
            break;
      }
   }
}

void check_connection_status_and_server_availability() {
   if (checking_connection_status_and_server_availability_timer_g == 0 && is_piped_tasks_scheduler_empty()) {
      checking_connection_status_and_server_availability_timer_g = TIMER14_30S;
      add_piped_task_to_send_into_tail(GET_CONNECTION_STATUS_FLAG);
      add_piped_task_to_send_into_tail(GET_SERVER_AVAILABILITY_FLAG);
   }
}

void check_visible_network_list() {
   if (!visible_network_list_timer_g && is_piped_tasks_scheduler_empty()) {
      visible_network_list_timer_g = TIMER14_10MIN;
      add_piped_task_to_send_into_tail(GET_VISIBLE_NETWORK_LIST_FLAG);
   }
}

void schedule_global_function_resending_and_send_request(unsigned int flag) {
   final_task_for_request_resending_g = flag;
   schedule_function_resending(resend_usart_get_request_using_global_final_task, 10, DO_NOT_EXECUTE_FUNCTION_IMMEDIATELY);

   send_request(flag);
}

void add_error() {
   send_usart_data_errors_counter_g++;
   send_usart_data_errors_unresetable_counter_g++;
   last_error_task_g = get_current_piped_task_to_send();

